/* ========================================
 * 文件：print.h
 * 作者：Helon
 * 日期：2016-05-14
 * 版本：Ver1.0
 * 描述：这个文件是相关Print函数重映射到串口的函数声明
 * ========================================
*/

#ifndef PRINT_H
#define PRINT_H

/* ****************************************
 * 头文件包含
 * ****************************************
*/
#include <project.h>
#include <stdio.h>   
    
    
/* ****************************************
 * 函数原型声明
 * ****************************************
*/ 
int _write(int file, char *ptr, int len);   
    
#endif    

/* [] END OF FILE */
